In [1]:
import os
import re
import json
import pickle
import random
from template_config import *
from collections import defaultdict
from nltk.stem.porter import PorterStemmer
from nltk.stem.wordnet import WordNetLemmatizer

In [13]:
import nltk
nltk.download('wordnet')

[nltk_data] Downloading package wordnet to /home/taoyu/nltk_data...
[nltk_data]   Unzipping corpora/wordnet.zip.

True

In [2]:
ps = PorterStemmer()
lmtzr = WordNetLemmatizer()

In [5]:
def read_in_all_data(data_path=DATA_PATH):
    training_data = json.load(open(os.path.join(data_path, "train_spider.json")))
    tables_org = json.load(open(os.path.join(data_path, "tables.json")))
    tables = {tab['db_id']: tab for tab in tables_org}

    return training_data, tables

In [6]:
def get_all_question_query_pairs(data):
    question_query_pairs = []
    for item in data:
        question_query_pairs.append((item['question_toks'], item['query'], item['db_id']))
    return question_query_pairs

In [7]:
training_data, tables = read_in_all_data("data")

train_qq_pairs = get_all_question_query_pairs(training_data)

In [9]:
print("Training question-query pair count: {}".format(len(train_qq_pairs)))

Training question-query pair count: 7000

In [10]:
def is_value(token):
    """
    as values can either be a numerical digit or a string literal, then we can
    detect if a token is a value by matching with regex
    """
    is_number = True
    try:
        float(token)
    except ValueError:
        is_number = False
    is_string = token.startswith("\"") or token.startswith("\'") or token.endswith("\"") or token.endswith("\'")

    return is_number or is_string


def remove_all_from_clauses(query_keywords):
    """
    remove all keywords from from clauses, until there is no more from clauses
    e.g. select {} from {} as {} where {} = {} --> select {} where {} = {}
    """
    # remove from clause by deleting the range from "FROM" to "WHERE" or "GROUP"
    start_location = 0
    count = 0
    while "FROM" in query_keywords:
        count += 1
        if count > 5:
            break
            print("error query_keywords: ", query_keywords)
        from_location = query_keywords.index("FROM")
        end_token_locations = [len(query_keywords)]  # defaulting to the end of the list
        for end_token in ["WHERE", "GROUP", "ORDER"]:
            try:
                end_token_locations.append(query_keywords.index(end_token, start_location))
            except ValueError:
                pass

        query_keywords = query_keywords[:from_location] + [FROM_SYMBOL] + query_keywords[min(end_token_locations):]
        start_location = min(end_token_locations)
        
    return query_keywords


def strip_query(query, table):
    """
    returns (stripped query, non keywords)
    """
    #get table column names info
    column_types = table['column_types']
    table_names_original = [cn.lower() for cn in table['table_names_original']]
    table_names = [cn.lower() for cn in table['table_names']]
    column_names = [cn.lower() for i, cn in table['column_names']]
    column_names_original = [cn.lower() for i, cn in table['column_names_original']]

    #clean query: replace values, numbers, column names with SYMBOL
    query_keywords = []
    columns = table_names_original + table_names

    query = query.replace(";","")
    query = query.replace("\t","")
    query = query.replace("(", " ( ").replace(")", " ) ")
    # then replace all stuff enclosed by "" with a numerical value to get it marked as {VALUE}
    str_1 = re.findall("\"[^\"]*\"", query)
    str_2 = re.findall("\'[^\']*\'", query)
    values = str_1 + str_2
    for val in values:
        query = query.replace(val.strip(), VALUE_STR_SYMBOL)

    query_tokenized = query.split(' ')
    float_nums = re.findall("[-+]?\d*\.\d+", query)
    query_tokenized = [VALUE_NUM_SYMBOL if qt in float_nums else qt for qt in query_tokenized]
    query = " ".join(query_tokenized)
    int_nums = [i.strip() for i in re.findall("[^tT]\d+", query)]
    query_tokenized = [VALUE_NUM_SYMBOL if qt in int_nums else qt for qt in query_tokenized]
    nums = float_nums + int_nums
        
    #query_tokenized = query.split(' ')
    cols_dict = {}
    for token in query_tokenized:
        if len(token.strip()) == 0:  # in case there are more than one space used
            continue
        if IGNORE_COMMAS_AND_ROUND_BRACKETS:
            keywords_dict = SQL_KEYWORDS_AND_OPERATORS_WITHOUT_COMMAS_AND_BRACES
        else:
            keywords_dict = SQL_KEYWORDS_AND_OPERATORS

        if token.upper() not in keywords_dict and token != VALUE_STR_SYMBOL and token != VALUE_NUM_SYMBOL:
            token = token.upper()
            if USE_COLUMN_AND_VALUE_REPLACEMENT_TOKEN:
                token = re.sub("[T]\d+\.", '', token)
                token = re.sub(r"\"|\'", '', token)
                token = re.sub("[T]\d+", '', token).lower()
#                 if token in table_names_original:
#                     query_keywords.append(TABLE_SYMBOL)
#                     continue
                if token != '' and token in column_names_original:
                    try:
                        tok_ind = column_names_original.index(token)
                    except:
                        print("\ntable: {}".format(table['db_id']))
                        print("\ntoken: {}".format(token))
                        print("column_names_original: {}".format(column_names_original))
                        print("query: {}".format(query))
                        print("query_tokenized: {}".format(query_tokenized))
                        exit(1)
                    col_type = column_types[tok_ind]
                    col_name = column_names[tok_ind]
                    columns.append(col_name)
                    columns.append(token)
                    if token not in cols_dict:
                        cols_dict[token] = COLUMN_SYMBOL.replace("}", str(len(cols_dict)))
                    query_keywords.append(cols_dict[token])
                elif token in table_names_original:
                    query_keywords.append(TABLE_SYMBOL)
                    continue
                    
        else:
            query_keywords.append(token.upper())

    if "FROM" in query_keywords:
        query_keywords = remove_all_from_clauses(query_keywords)

    if USE_LIMITED_KEYWORD_SET:
        query_keywords = [kw for kw in query_keywords if kw in LIMITED_KEYWORD_SET]

    columns_lemed = [lmtzr.lemmatize(w) for w in " ".join(columns).split(" ") if w not in LOW_CHAR]
    columns_lemed_stemed = [ps.stem(w) for w in columns_lemed]

    return " ".join(query_keywords), values, nums, columns_lemed_stemed


def filter_string(cs):
    return "".join([c.upper() for c in cs if c.isalpha() or c == ' '])


def process_question(question, values, nums, columns):

    question = " ".join(question).lower()
    values = [re.sub(r"\"|\'", '', val) for val in values]
    for val in values:
        val = val.lower()
        try:
            question = re.sub(r'\b'+val+r'\b', VALUE_STR_SYMBOL, question)
        except:
            continue

    for num in nums:
        num = num.strip()
        question = re.sub(r'\b'+num+r'\b', VALUE_NUM_SYMBOL, question)

    question_toks = question.split(" ")
    question_lemed = [lmtzr.lemmatize(w) for w in question_toks]
    question_lemed_stemed = [ps.stem(w) for w in question_lemed]
    replace_inds = [i for i, qt in enumerate(question_lemed_stemed) if qt in columns]
    #print("question_stemed: {}".format(question_stemed))
    #print("replace_inds: {}".format(replace_inds))
    for ind in replace_inds:
        question_toks[ind] = COLUMN_SYMBOL

    question_template = ' '.join(question_toks)

    return question_template

In [11]:
KEY_KEYWORD_SET = {"SELECT", "WHERE", "GROUP", "HAVING", "ORDER", "BY", "LIMIT", "EXCEPT", "UNION", "INTERSECT"}
ALL_KEYWORD_SET = {"SELECT", "WHERE", "GROUP", "HAVING", "DESC", "ORDER", "BY", "LIMIT", "EXCEPT", "UNION", 
                   "INTERSECT", "NOT", "IN", "OR", "LIKE", "(", ">", ")", "COUNT"}

WHERE_OPS = ['=', '>', '<', '>=', '<=', '!=', 'LIKE', 'IS', 'EXISTS']
AGG_OPS = ['MAX', 'MIN', 'SUM', 'AVG']
DASC = ['ASC', 'DESC']
def general_pattern(pattern):
    general_pattern_list = []
    for x in pattern.split(" "):
        if x in KEY_KEYWORD_SET:
            general_pattern_list.append(x)
    
    return " ".join(general_pattern_list)

def sub_pattern(pattern):
    general_pattern_list = []
    for x in pattern.split(" "):
        if x in ALL_KEYWORD_SET:
            general_pattern_list.append(x)
    
    return " ".join(general_pattern_list)

def tune_pattern(pattern):
    general_pattern_list = []
    cols_dict = {}
    for x in pattern.split(" "):
        if "{COLUMN" in x:
            if x not in cols_dict:
                cols_dict[x] = COLUMN_SYMBOL.replace("}", str(len(cols_dict))+"}")
            general_pattern_list.append(cols_dict[x])
            continue
            
        if "{VALUE" in x:
            general_pattern_list.append("{VALUE}")
            continue
            
        if x == 'DISTINCT':
            continue
        elif x in DASC:
            general_pattern_list.append("{DASC}")
        elif x in WHERE_OPS:
            general_pattern_list.append("{OP}")
        elif x in AGG_OPS:
            general_pattern_list.append("{AGG}")
        else:
            general_pattern_list.append(x)
    
    return " ".join(general_pattern_list)

In [14]:
training_question_pattern_pairs = []
training_patterns = set()

pattern_question_dict = defaultdict(list)

# train_qq_pairs
for eid, (question, query, bd_id) in enumerate(train_qq_pairs):
    table = tables[bd_id]
    if eid % 500 == 0:
        print("processing eid: ", eid)
    
    pattern, values, nums, columns = strip_query(query, table)
    question_template = process_question(question, values, nums, columns)
    
    gen_pattern = general_pattern(pattern)
    more_pattern = sub_pattern(pattern)
    tu_pattern = tune_pattern(pattern)
    
    pattern_question_dict[tu_pattern].append(' '.join(question) + " ||| " + 
                                              question_template + " ||| " + more_pattern
                                              + " ||| " + query)
#     print("\n--------------------------------------")
#     print("original question: {}".format(' '.join(question).encode('utf-8')))
#     print("question: {}".format(question_template.encode('utf-8')))
#     print("query: {}".format(query))
#     print("pattern: {}".format(pattern))
#     print("values: {}".format(values))
#     print("nums: {}".format(nums))
#     print("columns: {}".format(columns))

processing eid:  0
processing eid:  500
processing eid:  1000
processing eid:  1500
processing eid:  2000
processing eid:  2500
processing eid:  3000
processing eid:  3500
processing eid:  4000
processing eid:  4500
processing eid:  5000
processing eid:  5500
processing eid:  6000
processing eid:  6500

In [15]:
print("total pattern number: {}".format(len(pattern_question_dict)))
pattern_question_dict = sorted(pattern_question_dict.items(), key=lambda kv: len(kv[1]), reverse=True)

total pattern number: 517

In [17]:
# filter_nums = [762, 275, 241, 204, 202, 164, 98, 59, 55, 48]

In [16]:
for sql, qts in pattern_question_dict:
#     if len(qts) not in filter_nums:
#         continue
    print("\n--------------------------------------------")
    print("SQL Pattern: {}".format(sql))
    print("count: {}".format(len(qts)))
    for qt in qts:
        q, q_template, sql, sql_more = qt.split("|||")
        print("question: ", q.replace("""'""", "").replace("""``""", ''))
#         print("question: ", q_template.replace("""'""", "").replace("""``""", ''))
        print("SQL: {} \n".format(sql_more))
#     for qt in qts:
#         q, q_template, sql_temp, sql_more = qt.split("|||")
#     #     print("question: ", q_template)
#     #     print("sql_temp: ", sql_temp)
#     #     print("sql_more: ", sql_more)
#         if sql == 'SELECT {COLUMN0} {FROM} WHERE {COLUMN4} {OP} {VALUE_STR} AND {COLUMN5} {OP} {VALUE_STR}':
#             print(sql_more)

--------------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count: 794
question:  What are the distinct creation years of the departments managed by a secretary born in state Alabama  ?
SQL:  SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'

question:  What are the distinct ages of the heads who are acting ?
SQL:  SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'

question:  Please show the themes of competitions with host cities having populations larger than 1000 .
SQL:  SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000

question:  What are the themes of competitions that have corresponding host cities with more than 1000 residents ?
SQL:  SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000

question:  Find id of the candidate whose email is stanley.monahan @ example.org ?
SQL:  SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"

question:  What is the id of the candidate whose email is stanley.monahan @ example.org ?
SQL:  SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"

question:  Find id of candidates whose assessment code is  Pass  ?
SQL:  SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"

question:  What are the ids of the candidates that have an outcome code of Pass ?
SQL:  SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"

question:  Find the cell mobile number of the candidates whose assessment code is  Fail  ?
SQL:  SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"

question:  What are the cell phone numbers of the candidates that received an assessment code of  Fail  ?
SQL:  SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"

question:  What are the id of students who registered course 301 ?
SQL:  SELECT student_id FROM student_course_attendance WHERE course_id  =  301

question:  What are the ids of the students who registered for course 301 ?
SQL:  SELECT student_id FROM student_course_attendance WHERE course_id  =  301

question:  Give me the dates when the max temperature was higher than 85 .
SQL:  SELECT date FROM weather WHERE max_temperature_f  >  85

question:  What are the dates with a maximum temperature higher than 85 ?
SQL:  SELECT date FROM weather WHERE max_temperature_f  >  85

question:  What are the names of stations that have latitude lower than 37.5 ?
SQL:  SELECT name FROM station WHERE lat  <  37.5

question:  What are the names of all stations with a latitude smaller than 37.5 ?
SQL:  SELECT name FROM station WHERE lat  <  37.5

question:  Return the unique name for stations that have ever had 7 bikes available .
SQL:  SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7

question:  What are the different names for each station that has ever had 7 bikes available ?
SQL:  SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7

question:  List all the distinct stations from which a trip of duration below 100 started .
SQL:  SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100

question:  What are all the different start station names for a trip that lasted less than 100 ?
SQL:  SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100

question:  Find all the zip codes in which the max dew point have never reached 70 .
SQL:  SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70

question:  What are all the different zip codes that have a maximum dew point that was always below 70 ?
SQL:  SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70

question:  What are the distinct publishers of publications with price higher than 5000000 ?
SQL:  SELECT DISTINCT Publisher FROM publication WHERE Price  >  5000000

question:  Show writers who have published a book with price more than 4000000 .
SQL:  SELECT T1.Writer FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID  =  T2.Book_ID WHERE T2.Price  >  4000000

question:  What are the names of musicals with nominee  Bob Fosse  ?
SQL:  SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"

question:  Return the names of musicals who have the nominee Bob Fosse .
SQL:  SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"

question:  Find the emails of the user named  Mary  .
SQL:  SELECT email FROM user_profiles WHERE name  =  'Mary'

question:  What is the partition id of the user named  Iron Man  .
SQL:  SELECT partitionid FROM user_profiles WHERE name  =  'Iron Man'

question:  What is the attribute data type of the attribute with name  Green  ?
SQL:  SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"

question:  Find the attribute data type for the attribute named  Green  .
SQL:  SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"

question:  Find the names of all the products whose stock number starts with  2  .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE product_stock_number LIKE "2%"

question:  Which catalog contents have a product stock number that starts from  2  ? Show the catalog entry names .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE product_stock_number LIKE "2%"

question:  Find the names of catalog entries with level number 8 .
SQL:  SELECT t1.catalog_entry_name FROM Catalog_Contents AS t1 JOIN Catalog_Contents_Additional_Attributes AS t2 ON t1.catalog_entry_id  =  t2.catalog_entry_id WHERE t2.catalog_level_number  =  "8"

question:  What are the names of catalog entries with level number 8 ?
SQL:  SELECT t1.catalog_entry_name FROM Catalog_Contents AS t1 JOIN Catalog_Contents_Additional_Attributes AS t2 ON t1.catalog_entry_id  =  t2.catalog_entry_id WHERE t2.catalog_level_number  =  "8"

question:  Name all the products with next entry ID greater than 8 .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE next_entry_id  >  8

question:  What are the catalog entry names of the products with next entry ID above 8 ?
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE next_entry_id  >  8

question:  Show ids for all aircrafts with more than 1000 distance .
SQL:  SELECT aid FROM Aircraft WHERE distance  >  1000

question:  What are the ids of all aircrafts that can cover a distance of more than 1000 ?
SQL:  SELECT aid FROM Aircraft WHERE distance  >  1000

question:  Show ids for all employees with at least 100000 salary .
SQL:  SELECT eid FROM Employee WHERE salary  >  100000

question:  What is the id of every employee who has at least a salary of 100000 ?
SQL:  SELECT eid FROM Employee WHERE salary  >  100000

question:  Show all flight number from Los Angeles .
SQL:  SELECT flno FROM Flight WHERE origin  =  "Los Angeles"

question:  What are the numbers of all flights coming from Los Angeles ?
SQL:  SELECT flno FROM Flight WHERE origin  =  "Los Angeles"

question:  Show origins of all flights with destination Honolulu .
SQL:  SELECT origin FROM Flight WHERE destination  =  "Honolulu"

question:  What are the origins of all flights that are headed to Honolulu ?
SQL:  SELECT origin FROM Flight WHERE destination  =  "Honolulu"

question:  Show flight number for all flights with more than 2000 distance .
SQL:  SELECT flno FROM Flight WHERE distance  >  2000

question:  What are the numbers of all flights that can cover a distance of more than 2000 ?
SQL:  SELECT flno FROM Flight WHERE distance  >  2000

question:  What is the aircraft name for the flight with number 99
SQL:  SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99

question:  What is the name of the aircraft that was on flight number 99 ?
SQL:  SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99

question:  Show all flight numbers with aircraft Airbus A340-300 .
SQL:  SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"

question:  What are the flight numbers for the aircraft Airbus A340-300 ?
SQL:  SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"

question:  Show all allergies with type food .
SQL:  SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"

question:  What are all the different food allergies ?
SQL:  SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"

question:  What is the type of allergy Cat ?
SQL:  SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"

question:  What is allergy type of a cat allergy ?
SQL:  SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"

question:  Show student ids for all male students .
SQL:  SELECT StuID FROM Student WHERE Sex  =  'M'

question:  What are the student ids for all male students ?
SQL:  SELECT StuID FROM Student WHERE Sex  =  'M'

question:  Show all student ids who are older than 20 .
SQL:  SELECT StuID FROM Student WHERE age  >  20

question:  What are the student ids for students over 20 years old ?
SQL:  SELECT StuID FROM Student WHERE age  >  20

question:  Which city does the student whose last name is  Kim  live in ?
SQL:  SELECT city_code FROM Student WHERE LName  =  "Kim"

question:  Give the city that the student whose family name is Kim lives in .
SQL:  SELECT city_code FROM Student WHERE LName  =  "Kim"

question:  Who is the advisor of student with ID 1004 ?
SQL:  SELECT Advisor FROM Student WHERE StuID  =  1004

question:  Who advises student 1004 ?
SQL:  SELECT Advisor FROM Student WHERE StuID  =  1004

question:  List Aerosmith s albums .
SQL:  SELECT T1.title FROM albums AS T1 JOIN artists AS T2 ON  T1.artist_id = T2.id WHERE T2.name = "Aerosmith";

question:  What are the titles of all the Aerosmith albums ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN artists AS T2 ON  T1.artist_id = T2.id WHERE T2.name = "Aerosmith";

question:  List the name of albums that are released by aritist whose name has Led
SQL:  SELECT T2.title FROM artists AS T1 JOIN albums AS T2 ON T1.id  =  T2.artist_id WHERE T1.name LIKE '%Led%'

question:  What is the title of the album that was released by the artist whose name has the phrase Led  ?
SQL:  SELECT T2.title FROM artists AS T1 JOIN albums AS T2 ON T1.id  =  T2.artist_id WHERE T1.name LIKE '%Led%'

question:  Who is the composer of track Fast As a Shark ?
SQL:  SELECT composer FROM tracks WHERE name = "Fast As a Shark";

question:  What is the composer who created the track  Fast As a Shark  ?
SQL:  SELECT composer FROM tracks WHERE name = "Fast As a Shark";

question:  How long does track Fast As a Shark has ?
SQL:  SELECT milliseconds FROM tracks WHERE name = "Fast As a Shark";

question:  How many milliseconds long is Fast As a Shark ?
SQL:  SELECT milliseconds FROM tracks WHERE name = "Fast As a Shark";

question:  What is title of album which track Balls to the Wall belongs to ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T2.name = "Balls to the Wall";

question:  What is the name of the album that has the track Ball to the Wall ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T2.name = "Balls to the Wall";

question:  List name of all tracks in Balls to the Wall .
SQL:  SELECT T2.name FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.title = "Balls to the Wall";

question:  What is the name of all tracks in the album named Balls to the Wall ?
SQL:  SELECT T2.name FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.title = "Balls to the Wall";

question:  How much is the track Fast As a Shark ?
SQL:  SELECT unit_price FROM tracks WHERE name = "Fast As a Shark";

question:  What is the unit price of the tune  Fast As a Shark  ?
SQL:  SELECT unit_price FROM tracks WHERE name = "Fast As a Shark";

question:  List the names of editors who are older than 25 .
SQL:  SELECT Name FROM editor WHERE Age  >  25

question:  Show the names of editors that are on the committee of journals with sales bigger than 3000 .
SQL:  SELECT T2.Name FROM journal_committee AS T1 JOIN editor AS T2 ON T1.Editor_ID  =  T2.Editor_ID JOIN journal AS T3 ON T1.Journal_ID  =  T3.Journal_ID WHERE T3.Sales  >  3000

question:  Show other account details for account with name 338 .
SQL:  SELECT other_account_details FROM Accounts WHERE account_name  =  "338"

question:  What are the other account details for the account with the name 338 ?
SQL:  SELECT other_account_details FROM Accounts WHERE account_name  =  "338"

question:  What are the names for tracks without a race in class GT  .
SQL:  SELECT name FROM track EXCEPT SELECT T2.name FROM race AS T1 JOIN track AS T2 ON T1.track_id  =  T2.track_id WHERE T1.class  =  'GT'

question:  Give the names of tracks that do not have a race in the class GT  .
SQL:  SELECT name FROM track EXCEPT SELECT T2.name FROM race AS T1 JOIN track AS T2 ON T1.track_id  =  T2.track_id WHERE T1.class  =  'GT'

question:  Which address do not have any member with the black membership card ?
SQL:  SELECT address FROM member EXCEPT SELECT address FROM member WHERE Membership_card  =  'Black'

question:  Find the title of all the albums of the artist  AC/DC  .
SQL:  SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"

question:  What are the titles of albums by the artist  AC/DC  ?
SQL:  SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"

question:  Which artist does the album  Balls to the Wall  belong to ?
SQL:  SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"

question:  Find the name of the artist who made the album  Balls to the Wall  .
SQL:  SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"

question:  What city does the employee who helps the customer with postal code 70174 live in ?
SQL:  SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"

question:  Find the cities corresponding to employees who help customers with the postal code 70174 .
SQL:  SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"

question:  Find all the customer last names that do not have invoice totals larger than 20 .
SQL:  SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20

question:  What are the last names of customers without invoice totals exceeding 20 ?
SQL:  SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20

question:  Find the first names of all customers that live in Brazil and have an invoice .
SQL:  SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"

question:  What are the different first names for customers from Brazil who have also had an invoice ?
SQL:  SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"

question:  Find the address of all customers that live in Germany and have invoice .
SQL:  SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"

question:  What are the addresses of customers living in Germany who have had an invoice ?
SQL:  SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"

question:  What are the birth dates of employees living in Edmonton ?
SQL:  SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

question:  Find the birth dates corresponding to employees who live in the city of Edmonton .
SQL:  SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

question:  What are the customer phone numbers under the policy  Life Insurance  ?
SQL:  SELECT customer_phone FROM available_policies WHERE policy_type_code  =  "Life Insurance"

question:  What are the phone numbers of customers using the policy with the code  Life Insurance  ?
SQL:  SELECT customer_phone FROM available_policies WHERE policy_type_code  =  "Life Insurance"

question:  What are all the policy types of the customer named  Dayana Robel  ?
SQL:  SELECT DISTINCT t3.policy_type_code FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id JOIN available_policies AS t3 ON t2.policy_id  =  t3.policy_id WHERE t1.customer_name  =  "Dayana Robel"

question:  Tell me the types of the policy used by the customer named  Dayana Robel  .
SQL:  SELECT DISTINCT t3.policy_type_code FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id JOIN available_policies AS t3 ON t2.policy_id  =  t3.policy_id WHERE t1.customer_name  =  "Dayana Robel"

question:  Find the IDs of customers whose name contains  Diana  .
SQL:  SELECT customer_id FROM customers WHERE customer_name LIKE "%Diana%"

question:  What are the IDs of customers who have  Diana  in part of their names ?
SQL:  SELECT customer_id FROM customers WHERE customer_name LIKE "%Diana%"

question:  Find the names of the chip models that are not used by any phone with full accreditation type .
SQL:  SELECT model_name FROM chip_model EXCEPT SELECT chip_model FROM phone WHERE Accreditation_type  =  'Full'

question:  Show the players from college UCLA .
SQL:  SELECT Player FROM match_season WHERE College  =  "UCLA"

question:  Who are the players from UCLA ?
SQL:  SELECT Player FROM match_season WHERE College  =  "UCLA"

question:  Which players are from Indonesia ?
SQL:  SELECT T2.Player FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Country_name  =  "Indonesia"

question:  Who are the players from Indonesia ?
SQL:  SELECT T2.Player FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Country_name  =  "Indonesia"

question:  What are the distinct positions of the players from a country whose capital is Dublin ?
SQL:  SELECT DISTINCT T2.Position FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Capital  =  "Dublin"

question:  Give the different positions of players who play for the country with the capital Dublin .
SQL:  SELECT DISTINCT T2.Position FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Capital  =  "Dublin"

question:  Show the positions of the players from the team with name  Ryley Goldner  .
SQL:  SELECT T1.Position FROM match_season AS T1 JOIN team AS T2 ON T1.Team  =  T2.Team_id WHERE T2.Name  =  "Ryley Goldner"

question:  Return the positions of players on the team Ryley Goldner .

In [17]:
for sql, qts in pattern_question_dict:
    print("\n")
    print("SQL Pattern: {}".format(sql))
    print("count: ", len(qts))

SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  794


SQL Pattern: SELECT {COLUMN0} {FROM}
count:  275


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  260


SQL Pattern: SELECT COUNT ( * ) {FROM}
count:  241


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  239


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM}
count:  210


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0}
count:  208


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  206


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} {DASC} LIMIT {VALUE}
count:  184


SQL Pattern: SELECT COUNT ( {COLUMN0} ) {FROM}
count:  166


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  151


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  149


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  134


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  112


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} {DASC}
count:  108


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM}
count:  98


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} NOT IN ( SELECT {COLUMN1} {FROM}
count:  84


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} OR {COLUMN1} {OP} {VALUE}
count:  83


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE}
count:  79


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  75


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  70


SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} GROUP BY {COLUMN0}
count:  64


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM}
count:  63


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {AGG} ( {COLUMN1} ) {FROM}
count:  61


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} HAVING COUNT ( * ) {OP} {VALUE}
count:  60


SQL Pattern: SELECT COUNT ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  58


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {VALUE}
count:  55


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {COLUMN1} {FROM} GROUP BY {COLUMN1}
count:  53


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0}
count:  51


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} {DASC} LIMIT {VALUE}
count:  50


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM}
count:  48


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  47


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0} {DASC}
count:  41


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  39


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  39


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} AND {COLUMN3} {OP} {VALUE}
count:  38


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} LIMIT {VALUE}
count:  37


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN1}
count:  35


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {AGG} ( {COLUMN1} ) {FROM} WHERE {COLUMN2} {OP} {VALUE} )
count:  34


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} NOT IN ( SELECT {COLUMN0} {FROM}
count:  33


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1}
count:  31


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} OR {COLUMN2} {OP} {VALUE}
count:  30


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE}
count:  30


SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0}
count:  29


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} BETWEEN {VALUE} AND {VALUE}
count:  27


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM}
count:  27


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  26


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  25


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} OR {COLUMN2} {OP} {VALUE}
count:  25


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  25


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  25


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN1} {DASC} LIMIT {VALUE}
count:  24


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY {AGG} ( {COLUMN1} ) {DASC} LIMIT {VALUE}
count:  23


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} LIMIT {VALUE}
count:  22


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} {DASC}
count:  22


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  22


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE} AND {COLUMN3} {OP} {VALUE}
count:  21


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0}
count:  20


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2} {DASC} LIMIT {VALUE}
count:  19


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  19


SQL Pattern: SELECT * {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  18


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN1} HAVING COUNT ( * ) {OP} {VALUE}
count:  17


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} ( SELECT {AGG} ( {COLUMN2} ) {FROM}
count:  17


SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0} {DASC} LIMIT {VALUE}
count:  17


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} NOT IN ( SELECT {COLUMN2} {FROM}
count:  16


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  16


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN0}
count:  16


SQL Pattern: SELECT {COLUMN0} , {COLUMN0} {FROM}
count:  15


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} NOT IN ( SELECT {COLUMN2} {FROM}
count:  15


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2}
count:  15


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC}
count:  15


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  15


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN0}
count:  15


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN1} ) {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  14


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN0} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE}
count:  14


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} , {COLUMN3} {FROM}
count:  14


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2}
count:  13


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} INTERSECT SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  13


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  13


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) LIMIT {VALUE}
count:  12


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3} {DASC} LIMIT {VALUE}
count:  12


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING {AGG} ( {COLUMN1} ) {OP} {VALUE}
count:  12


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  12


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN2} HAVING COUNT ( * ) {OP} {VALUE}
count:  12


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  12


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} OR {COLUMN0} {OP} {VALUE}
count:  12


SQL Pattern: SELECT * {FROM}
count:  12


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3}
count:  12


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  11


SQL Pattern: SELECT {COLUMN0} , COUNT ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  11


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , COUNT ( * ) {FROM} GROUP BY {COLUMN1}
count:  11


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} ORDER BY {AGG} ( {COLUMN2} ) {DASC} LIMIT {VALUE}
count:  11


SQL Pattern: SELECT {COLUMN0} , {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  11


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  10


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN1}
count:  10


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} NOT IN ( SELECT {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE} )
count:  10


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} OR {COLUMN1} {OP} {VALUE}
count:  10


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN0} {DASC}
count:  10


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} EXCEPT SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  10


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE} UNION SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  10


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} ( SELECT {AGG} ( {COLUMN0} ) {FROM}
count:  10


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) LIMIT {VALUE}
count:  10


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} ( SELECT {AGG} ( {COLUMN2} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} )
count:  10


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} HAVING {AGG} ( {COLUMN2} ) {OP} {VALUE}
count:  9


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE}
count:  9


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} NOT IN ( SELECT {COLUMN1} {FROM}
count:  9


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} NOT IN ( SELECT {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} )
count:  9


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} UNION SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  8


SQL Pattern: SELECT ( {COLUMN0} ) {FROM}
count:  8


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE} OR {COLUMN0} {OP} {VALUE}
count:  8


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} GROUP BY {COLUMN1}
count:  8


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} BETWEEN {VALUE} AND {VALUE}
count:  8


SQL Pattern: SELECT * {FROM} ORDER BY {COLUMN0}
count:  8


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) , {COLUMN1} {FROM} GROUP BY {COLUMN1}
count:  8


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} OR {COLUMN1} {OP} {VALUE}
count:  8


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {AGG} ( {COLUMN2} ) {FROM} GROUP BY {COLUMN1}
count:  8


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( {COLUMN1} ) {OP} {VALUE}
count:  8


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} EXCEPT SELECT {COLUMN0} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  8


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  7


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0} ORDER BY {AGG} ( {COLUMN1} ) {DASC} LIMIT {VALUE}
count:  7


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , COUNT ( * ) {FROM} GROUP BY {COLUMN0}
count:  7


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  7


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {VALUE}
count:  7


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN2}
count:  7


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN2}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} ( SELECT {AGG} ( {COLUMN2} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} )
count:  6


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN1} {DASC}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN1} BETWEEN {VALUE} AND {VALUE}
count:  6


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} BETWEEN {VALUE} AND {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} IN ( SELECT {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE} INTERSECT SELECT {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE} )
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} HAVING COUNT ( {COLUMN2} ) {OP} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} OR {COLUMN3} {OP} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {COLUMN1} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE} )
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} , {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN1} LIMIT {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} EXCEPT SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3} {DASC}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} UNION SELECT {COLUMN0} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  6


SQL Pattern: SELECT COUNT ( {COLUMN0} ) , {COLUMN1} {FROM} GROUP BY {COLUMN1}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} EXCEPT SELECT {COLUMN0} {FROM}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  6


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2} {DASC}
count:  6


SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC}
count:  6


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  5


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} ORDER BY {COLUMN0}
count:  5


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  5


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  5


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN2} HAVING COUNT ( * ) {OP} {VALUE}
count:  5


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN1} ) , {COLUMN2} {FROM} GROUP BY {COLUMN2}
count:  5


SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} GROUP BY {COLUMN1}
count:  5


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} NOT IN ( SELECT {COLUMN0} {FROM}
count:  4


SQL Pattern: SELECT * {FROM} WHERE {COLUMN0} NOT IN ( SELECT {COLUMN0} {FROM}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {AGG} ( {COLUMN2} ) {FROM} GROUP BY {COLUMN3}
count:  4


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN1} ) {FROM}
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {COLUMN1} {FROM} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE} )
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , COUNT ( * ) {FROM} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE} AND {COLUMN4} {OP} {VALUE}
count:  4


SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN1} {FROM}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN1} {OP} ( SELECT {AGG} ( {COLUMN1} ) {FROM}
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE} EXCEPT SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} IN ( SELECT {COLUMN2} {FROM} WHERE {COLUMN0} {OP} {VALUE} )
count:  4


SQL Pattern: SELECT COUNT ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN1} ORDER BY {AGG} ( {COLUMN2} ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} ( SELECT {AGG} ( {COLUMN2} ) {FROM} WHERE {COLUMN3} {OP} {VALUE} )
count:  4


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN2} {OP} {VALUE} GROUP BY {COLUMN1} ORDER BY {COLUMN2}
count:  4


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN2} ORDER BY {AGG} ( {COLUMN1} ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} ORDER BY {COLUMN3}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} HAVING {AGG} ( {COLUMN2} ) {OP} {VALUE}
count:  4


SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} AND {COLUMN3} {VALUE}
count:  4


SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} , {COLUMN1} HAVING COUNT ( {COLUMN2} ) {OP} {VALUE}
count:  4


SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN1} ) , {COLUMN2} {FROM} GROUP BY {COLUMN2} ORDER BY {COLUMN2}

In [18]:
for sql_template, qts in pattern_question_dict:
    print("\n--------------------------------------")
    print("SQL Pattern: {}".format(sql_template))
    print("count: ", len(qts))
    sql_dict = defaultdict(int)
    for qt in qts:
        q, q_template, sql, sql_more = qt.split("|||")
        sql_dict[sql] += 1
        
    sql_count = sorted(sql_dict.items(), key=lambda kv: kv[1])
    for sql, count in sql_count:
        print("SQL: {}, count: {}".format(sql, count))

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  794
SQL:  SELECT WHERE LIKE , count: 47
SQL:  SELECT WHERE > , count: 103
SQL:  SELECT WHERE , count: 644

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM}
count:  275
SQL:  SELECT , count: 275

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  260
SQL:  SELECT WHERE LIKE , count: 15
SQL:  SELECT WHERE > , count: 22
SQL:  SELECT WHERE , count: 223

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) {FROM}
count:  241
SQL:  SELECT COUNT ( ) , count: 241

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  239
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 22
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 217

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM}
count:  210
SQL:  SELECT , count: 210

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0}
count:  208
SQL:  SELECT COUNT ( ) GROUP BY , count: 208

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  206
SQL:  SELECT COUNT ( ) WHERE > , count: 14
SQL:  SELECT COUNT ( ) WHERE LIKE , count: 16
SQL:  SELECT COUNT ( ) WHERE , count: 176

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} {DASC} LIMIT {VALUE}
count:  184
SQL:  SELECT ORDER BY LIMIT , count: 25
SQL:  SELECT ORDER BY DESC LIMIT , count: 159

--------------------------------------
SQL Pattern: SELECT COUNT ( {COLUMN0} ) {FROM}
count:  166
SQL:  SELECT COUNT ( ) , count: 166

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  151
SQL:  SELECT WHERE INTERSECT SELECT WHERE > , count: 9
SQL:  SELECT WHERE > INTERSECT SELECT WHERE , count: 30
SQL:  SELECT WHERE INTERSECT SELECT WHERE , count: 112

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  149
SQL:  SELECT WHERE LIKE , count: 2
SQL:  SELECT WHERE > , count: 29
SQL:  SELECT WHERE , count: 118

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  134
SQL:  SELECT GROUP BY HAVING COUNT ( ) > , count: 62
SQL:  SELECT GROUP BY HAVING COUNT ( ) , count: 72

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  112
SQL:  SELECT ( ) WHERE LIKE , count: 2
SQL:  SELECT ( ) WHERE > , count: 9
SQL:  SELECT ( ) WHERE , count: 101

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} {DASC}
count:  108
SQL:  SELECT ORDER BY , count: 48
SQL:  SELECT ORDER BY DESC , count: 60

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM}
count:  98
SQL:  SELECT ( ) , count: 98

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} NOT IN ( SELECT {COLUMN1} {FROM}
count:  84
SQL:  SELECT WHERE NOT IN ( SELECT , count: 84

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} OR {COLUMN1} {OP} {VALUE}
count:  83
SQL:  SELECT WHERE LIKE OR LIKE , count: 1
SQL:  SELECT WHERE > OR > , count: 1
SQL:  SELECT WHERE OR > , count: 6
SQL:  SELECT WHERE > OR , count: 9
SQL:  SELECT WHERE OR , count: 66

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE}
count:  79
SQL:  SELECT COUNT ( ) WHERE > > , count: 4
SQL:  SELECT COUNT ( ) WHERE > , count: 9
SQL:  SELECT COUNT ( ) WHERE , count: 66

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  75
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 4
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 71

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  70
SQL:  SELECT WHERE , count: 26
SQL:  SELECT WHERE LIKE , count: 44

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} GROUP BY {COLUMN0}
count:  64
SQL:  SELECT COUNT ( ) GROUP BY , count: 64

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM}
count:  63
SQL:  SELECT , count: 63

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {AGG} ( {COLUMN1} ) {FROM}
count:  61
SQL:  SELECT WHERE > ( SELECT ( ) , count: 21
SQL:  SELECT WHERE ( SELECT ( ) , count: 40

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} HAVING COUNT ( * ) {OP} {VALUE}
count:  60
SQL:  SELECT GROUP BY HAVING COUNT ( ) > , count: 27
SQL:  SELECT GROUP BY HAVING COUNT ( ) , count: 33

--------------------------------------
SQL Pattern: SELECT COUNT ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  58
SQL:  SELECT COUNT ( ) WHERE > , count: 3
SQL:  SELECT COUNT ( ) WHERE , count: 55

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {VALUE}
count:  55
SQL:  SELECT WHERE , count: 55

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {COLUMN1} {FROM} GROUP BY {COLUMN1}
count:  53
SQL:  SELECT ( ) GROUP BY , count: 53

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0}
count:  51
SQL:  SELECT ORDER BY , count: 51

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} {DASC} LIMIT {VALUE}
count:  50
SQL:  SELECT ORDER BY LIMIT , count: 6
SQL:  SELECT ORDER BY DESC LIMIT , count: 44

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM}
count:  48
SQL:  SELECT ( ) ( ) , count: 48

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {AGG} ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  47
SQL:  SELECT ( ) GROUP BY , count: 47

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0} {DASC}
count:  41
SQL:  SELECT ORDER BY DESC , count: 11
SQL:  SELECT ORDER BY , count: 30

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  39
SQL:  SELECT WHERE > GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 6
SQL:  SELECT WHERE GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 33

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE}
count:  39
SQL:  SELECT ( ) WHERE > , count: 1
SQL:  SELECT ( ) WHERE , count: 38

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} AND {COLUMN3} {OP} {VALUE}
count:  38
SQL:  SELECT WHERE > , count: 2
SQL:  SELECT WHERE > > , count: 2
SQL:  SELECT WHERE , count: 34

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1} LIMIT {VALUE}
count:  37
SQL:  SELECT ORDER BY LIMIT , count: 37

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN1}
count:  35
SQL:  SELECT COUNT ( ) GROUP BY , count: 35

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} ( SELECT {AGG} ( {COLUMN1} ) {FROM} WHERE {COLUMN2} {OP} {VALUE} )
count:  34
SQL:  SELECT WHERE ( SELECT ( ) WHERE ) , count: 12
SQL:  SELECT WHERE > ( SELECT ( ) WHERE ) , count: 22

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} NOT IN ( SELECT {COLUMN0} {FROM}
count:  33
SQL:  SELECT COUNT ( ) WHERE NOT IN ( SELECT , count: 33

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN1}
count:  31
SQL:  SELECT ORDER BY , count: 31

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} OR {COLUMN2} {OP} {VALUE}
count:  30
SQL:  SELECT WHERE > OR , count: 3
SQL:  SELECT WHERE OR > , count: 7
SQL:  SELECT WHERE > OR > , count: 7
SQL:  SELECT WHERE OR , count: 13

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} WHERE {COLUMN3} {OP} {VALUE}
count:  30
SQL:  SELECT WHERE , count: 30

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) , {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0}
count:  29
SQL:  SELECT COUNT ( ) WHERE > GROUP BY , count: 14
SQL:  SELECT COUNT ( ) WHERE GROUP BY , count: 15

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} BETWEEN {VALUE} AND {VALUE}
count:  27
SQL:  SELECT WHERE , count: 27

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM}
count:  27
SQL:  SELECT ( ) ( ) ( ) , count: 27

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  26
SQL:  SELECT COUNT ( ) GROUP BY ORDER BY COUNT ( ) LIMIT , count: 1
SQL:  SELECT COUNT ( ) GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 25

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  25
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 25

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} OR {COLUMN2} {OP} {VALUE}
count:  25
SQL:  SELECT WHERE OR > , count: 2
SQL:  SELECT WHERE > OR , count: 3
SQL:  SELECT WHERE OR , count: 20

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  25
SQL:  SELECT GROUP BY HAVING COUNT ( ) > , count: 7
SQL:  SELECT GROUP BY HAVING COUNT ( ) , count: 18

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  25
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 2
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 23

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN1} {DASC} LIMIT {VALUE}
count:  24
SQL:  SELECT ORDER BY LIMIT , count: 6
SQL:  SELECT ORDER BY DESC LIMIT , count: 18

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY {AGG} ( {COLUMN1} ) {DASC} LIMIT {VALUE}
count:  23
SQL:  SELECT GROUP BY ORDER BY ( ) DESC LIMIT , count: 23

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} LIMIT {VALUE}
count:  22
SQL:  SELECT ORDER BY LIMIT , count: 22

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2} {DASC}
count:  22
SQL:  SELECT ORDER BY , count: 2
SQL:  SELECT ORDER BY DESC , count: 20

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN1} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  22
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 2
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 20

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} AND {COLUMN2} {OP} {VALUE} AND {COLUMN3} {OP} {VALUE}
count:  21
SQL:  SELECT WHERE > , count: 2
SQL:  SELECT WHERE > > , count: 2
SQL:  SELECT WHERE LIKE , count: 2
SQL:  SELECT WHERE , count: 15

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0}
count:  20
SQL:  SELECT COUNT ( ) WHERE > GROUP BY , count: 3
SQL:  SELECT COUNT ( ) WHERE GROUP BY , count: 17

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2} {DASC} LIMIT {VALUE}
count:  19
SQL:  SELECT WHERE ORDER BY LIMIT , count: 2
SQL:  SELECT WHERE ORDER BY DESC LIMIT , count: 17

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN0} ) {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  19
SQL:  SELECT ( ) ( ) WHERE > , count: 2
SQL:  SELECT ( ) ( ) WHERE LIKE , count: 2
SQL:  SELECT ( ) ( ) WHERE , count: 15

--------------------------------------
SQL Pattern: SELECT * {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  18
SQL:  SELECT WHERE > , count: 2
SQL:  SELECT WHERE , count: 16

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN1} HAVING COUNT ( * ) {OP} {VALUE}
count:  17
SQL:  SELECT GROUP BY HAVING COUNT ( ) > , count: 5
SQL:  SELECT GROUP BY HAVING COUNT ( ) , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} ( SELECT {AGG} ( {COLUMN2} ) {FROM}
count:  17
SQL:  SELECT WHERE > ( SELECT ( ) , count: 7
SQL:  SELECT WHERE ( SELECT ( ) , count: 10

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} ORDER BY {COLUMN0} {DASC} LIMIT {VALUE}
count:  17
SQL:  SELECT ORDER BY LIMIT , count: 7
SQL:  SELECT ORDER BY DESC LIMIT , count: 10

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} NOT IN ( SELECT {COLUMN2} {FROM}
count:  16
SQL:  SELECT WHERE NOT IN ( SELECT , count: 16

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN2} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  16
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 4
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN0}
count:  16
SQL:  SELECT WHERE > ORDER BY , count: 2
SQL:  SELECT WHERE ORDER BY , count: 14

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN0} {FROM}
count:  15
SQL:  SELECT , count: 15

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} NOT IN ( SELECT {COLUMN2} {FROM}
count:  15
SQL:  SELECT WHERE NOT IN ( SELECT , count: 15

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN2}
count:  15
SQL:  SELECT ORDER BY , count: 15

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( * ) {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC}
count:  15
SQL:  SELECT COUNT ( ) GROUP BY ORDER BY COUNT ( ) , count: 4
SQL:  SELECT COUNT ( ) GROUP BY ORDER BY COUNT ( ) DESC , count: 11

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  15
SQL:  SELECT WHERE INTERSECT SELECT WHERE > , count: 3
SQL:  SELECT WHERE INTERSECT SELECT WHERE , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} ORDER BY {COLUMN0}
count:  15
SQL:  SELECT ORDER BY , count: 15

--------------------------------------
SQL Pattern: SELECT {AGG} ( {COLUMN0} ) , {AGG} ( {COLUMN1} ) {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  14
SQL:  SELECT ( ) ( ) WHERE , count: 14

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN0} {OP} {VALUE} AND {COLUMN1} {OP} {VALUE}
count:  14
SQL:  SELECT WHERE , count: 14

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} , {COLUMN3} {FROM}
count:  14
SQL:  SELECT , count: 14

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} ORDER BY {COLUMN2}
count:  13
SQL:  SELECT WHERE ORDER BY , count: 13

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE} INTERSECT SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN2} {OP} {VALUE}
count:  13
SQL:  SELECT WHERE INTERSECT SELECT WHERE , count: 13

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE} GROUP BY {COLUMN0} HAVING COUNT ( * ) {OP} {VALUE}
count:  13
SQL:  SELECT WHERE > GROUP BY HAVING COUNT ( ) > , count: 2
SQL:  SELECT WHERE GROUP BY HAVING COUNT ( ) > , count: 2
SQL:  SELECT WHERE GROUP BY HAVING COUNT ( ) , count: 4
SQL:  SELECT WHERE > GROUP BY HAVING COUNT ( ) , count: 5

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) LIMIT {VALUE}
count:  12
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3} {DASC} LIMIT {VALUE}
count:  12
SQL:  SELECT ORDER BY DESC LIMIT , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN0} HAVING {AGG} ( {COLUMN1} ) {OP} {VALUE}
count:  12
SQL:  SELECT GROUP BY HAVING ( ) , count: 6
SQL:  SELECT GROUP BY HAVING ( ) > , count: 6

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  12
SQL:  SELECT WHERE > , count: 1
SQL:  SELECT WHERE LIKE , count: 3
SQL:  SELECT WHERE , count: 8

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} {FROM} GROUP BY {COLUMN2} HAVING COUNT ( * ) {OP} {VALUE}
count:  12
SQL:  SELECT GROUP BY HAVING COUNT ( ) , count: 3
SQL:  SELECT GROUP BY HAVING COUNT ( ) > , count: 9

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE} INTERSECT SELECT {COLUMN0} {FROM} WHERE {COLUMN0} {OP} {VALUE}
count:  12
SQL:  SELECT WHERE INTERSECT SELECT WHERE , count: 12

--------------------------------------
SQL Pattern: SELECT COUNT ( * ) {FROM} WHERE {COLUMN0} {OP} {VALUE} OR {COLUMN0} {OP} {VALUE}
count:  12
SQL:  SELECT COUNT ( ) WHERE OR , count: 12

--------------------------------------
SQL Pattern: SELECT * {FROM}
count:  12
SQL:  SELECT , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} ORDER BY {COLUMN3}
count:  12
SQL:  SELECT ORDER BY , count: 12

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , {COLUMN2} {FROM} GROUP BY {COLUMN0} ORDER BY COUNT ( * ) {DASC} LIMIT {VALUE}
count:  11
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) LIMIT , count: 3
SQL:  SELECT GROUP BY ORDER BY COUNT ( ) DESC LIMIT , count: 8

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , COUNT ( {COLUMN1} ) {FROM} GROUP BY {COLUMN0}
count:  11
SQL:  SELECT COUNT ( ) GROUP BY , count: 11

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN1} , COUNT ( * ) {FROM} GROUP BY {COLUMN1}
count:  11
SQL:  SELECT COUNT ( ) GROUP BY , count: 11

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} GROUP BY {COLUMN1} ORDER BY {AGG} ( {COLUMN2} ) {DASC} LIMIT {VALUE}
count:  11
SQL:  SELECT GROUP BY ORDER BY ( ) DESC LIMIT , count: 11

--------------------------------------
SQL Pattern: SELECT {COLUMN0} , {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  11
SQL:  SELECT WHERE > , count: 3
SQL:  SELECT WHERE , count: 8

--------------------------------------

In [19]:
for sql_template, qts in pattern_question_dict:
    print("\n--------------------------------------")
    print("SQL Pattern: {}".format(sql_template))
    print("count: ", len(qts))
    for qt in qts:
        q, q_template, sql, sql_more = qt.split("|||")
        print("question: ", q)
        print("SQL: {} \n".format(sql_more))

--------------------------------------
SQL Pattern: SELECT {COLUMN0} {FROM} WHERE {COLUMN1} {OP} {VALUE}
count:  794
question:  What are the distinct creation years of the departments managed by a secretary born in state 'Alabama ' ?
SQL:  SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'

question:  What are the distinct ages of the heads who are acting ?
SQL:  SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'

question:  Please show the themes of competitions with host cities having populations larger than 1000 .
SQL:  SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000

question:  What are the themes of competitions that have corresponding host cities with more than 1000 residents ?
SQL:  SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000

question:  Find id of the candidate whose email is stanley.monahan @ example.org ?
SQL:  SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"

question:  What is the id of the candidate whose email is stanley.monahan @ example.org ?
SQL:  SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"

question:  Find id of candidates whose assessment code is `` Pass '' ?
SQL:  SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"

question:  What are the ids of the candidates that have an outcome code of Pass ?
SQL:  SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"

question:  Find the cell mobile number of the candidates whose assessment code is `` Fail '' ?
SQL:  SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"

question:  What are the cell phone numbers of the candidates that received an assessment code of `` Fail '' ?
SQL:  SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"

question:  What are the id of students who registered course 301 ?
SQL:  SELECT student_id FROM student_course_attendance WHERE course_id  =  301

question:  What are the ids of the students who registered for course 301 ?
SQL:  SELECT student_id FROM student_course_attendance WHERE course_id  =  301

question:  Give me the dates when the max temperature was higher than 85 .
SQL:  SELECT date FROM weather WHERE max_temperature_f  >  85

question:  What are the dates with a maximum temperature higher than 85 ?
SQL:  SELECT date FROM weather WHERE max_temperature_f  >  85

question:  What are the names of stations that have latitude lower than 37.5 ?
SQL:  SELECT name FROM station WHERE lat  <  37.5

question:  What are the names of all stations with a latitude smaller than 37.5 ?
SQL:  SELECT name FROM station WHERE lat  <  37.5

question:  Return the unique name for stations that have ever had 7 bikes available .
SQL:  SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7

question:  What are the different names for each station that has ever had 7 bikes available ?
SQL:  SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7

question:  List all the distinct stations from which a trip of duration below 100 started .
SQL:  SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100

question:  What are all the different start station names for a trip that lasted less than 100 ?
SQL:  SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100

question:  Find all the zip codes in which the max dew point have never reached 70 .
SQL:  SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70

question:  What are all the different zip codes that have a maximum dew point that was always below 70 ?
SQL:  SELECT DISTINCT zip_code FROM weather EXCEPT SELECT DISTINCT zip_code FROM weather WHERE max_dew_point_f  >=  70

question:  What are the distinct publishers of publications with price higher than 5000000 ?
SQL:  SELECT DISTINCT Publisher FROM publication WHERE Price  >  5000000

question:  Show writers who have published a book with price more than 4000000 .
SQL:  SELECT T1.Writer FROM book AS T1 JOIN publication AS T2 ON T1.Book_ID  =  T2.Book_ID WHERE T2.Price  >  4000000

question:  What are the names of musicals with nominee `` Bob Fosse '' ?
SQL:  SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"

question:  Return the names of musicals who have the nominee Bob Fosse .
SQL:  SELECT Name FROM musical WHERE Nominee  =  "Bob Fosse"

question:  Find the emails of the user named `` Mary '' .
SQL:  SELECT email FROM user_profiles WHERE name  =  'Mary'

question:  What is the partition id of the user named `` Iron Man '' .
SQL:  SELECT partitionid FROM user_profiles WHERE name  =  'Iron Man'

question:  What is the attribute data type of the attribute with name `` Green '' ?
SQL:  SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"

question:  Find the attribute data type for the attribute named `` Green '' .
SQL:  SELECT attribute_data_type FROM Attribute_Definitions WHERE attribute_name  =  "Green"

question:  Find the names of all the products whose stock number starts with `` 2 '' .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE product_stock_number LIKE "2%"

question:  Which catalog contents have a product stock number that starts from `` 2 '' ? Show the catalog entry names .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE product_stock_number LIKE "2%"

question:  Find the names of catalog entries with level number 8 .
SQL:  SELECT t1.catalog_entry_name FROM Catalog_Contents AS t1 JOIN Catalog_Contents_Additional_Attributes AS t2 ON t1.catalog_entry_id  =  t2.catalog_entry_id WHERE t2.catalog_level_number  =  "8"

question:  What are the names of catalog entries with level number 8 ?
SQL:  SELECT t1.catalog_entry_name FROM Catalog_Contents AS t1 JOIN Catalog_Contents_Additional_Attributes AS t2 ON t1.catalog_entry_id  =  t2.catalog_entry_id WHERE t2.catalog_level_number  =  "8"

question:  Name all the products with next entry ID greater than 8 .
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE next_entry_id  >  8

question:  What are the catalog entry names of the products with next entry ID above 8 ?
SQL:  SELECT catalog_entry_name FROM catalog_contents WHERE next_entry_id  >  8

question:  Show ids for all aircrafts with more than 1000 distance .
SQL:  SELECT aid FROM Aircraft WHERE distance  >  1000

question:  What are the ids of all aircrafts that can cover a distance of more than 1000 ?
SQL:  SELECT aid FROM Aircraft WHERE distance  >  1000

question:  Show ids for all employees with at least 100000 salary .
SQL:  SELECT eid FROM Employee WHERE salary  >  100000

question:  What is the id of every employee who has at least a salary of 100000 ?
SQL:  SELECT eid FROM Employee WHERE salary  >  100000

question:  Show all flight number from Los Angeles .
SQL:  SELECT flno FROM Flight WHERE origin  =  "Los Angeles"

question:  What are the numbers of all flights coming from Los Angeles ?
SQL:  SELECT flno FROM Flight WHERE origin  =  "Los Angeles"

question:  Show origins of all flights with destination Honolulu .
SQL:  SELECT origin FROM Flight WHERE destination  =  "Honolulu"

question:  What are the origins of all flights that are headed to Honolulu ?
SQL:  SELECT origin FROM Flight WHERE destination  =  "Honolulu"

question:  Show flight number for all flights with more than 2000 distance .
SQL:  SELECT flno FROM Flight WHERE distance  >  2000

question:  What are the numbers of all flights that can cover a distance of more than 2000 ?
SQL:  SELECT flno FROM Flight WHERE distance  >  2000

question:  What is the aircraft name for the flight with number 99
SQL:  SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99

question:  What is the name of the aircraft that was on flight number 99 ?
SQL:  SELECT T2.name FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T1.flno  =  99

question:  Show all flight numbers with aircraft Airbus A340-300 .
SQL:  SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"

question:  What are the flight numbers for the aircraft Airbus A340-300 ?
SQL:  SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"

question:  Show all allergies with type food .
SQL:  SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"

question:  What are all the different food allergies ?
SQL:  SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"

question:  What is the type of allergy Cat ?
SQL:  SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"

question:  What is allergy type of a cat allergy ?
SQL:  SELECT allergytype FROM Allergy_type WHERE allergy  =  "Cat"

question:  Show student ids for all male students .
SQL:  SELECT StuID FROM Student WHERE Sex  =  'M'

question:  What are the student ids for all male students ?
SQL:  SELECT StuID FROM Student WHERE Sex  =  'M'

question:  Show all student ids who are older than 20 .
SQL:  SELECT StuID FROM Student WHERE age  >  20

question:  What are the student ids for students over 20 years old ?
SQL:  SELECT StuID FROM Student WHERE age  >  20

question:  Which city does the student whose last name is `` Kim '' live in ?
SQL:  SELECT city_code FROM Student WHERE LName  =  "Kim"

question:  Give the city that the student whose family name is Kim lives in .
SQL:  SELECT city_code FROM Student WHERE LName  =  "Kim"

question:  Who is the advisor of student with ID 1004 ?
SQL:  SELECT Advisor FROM Student WHERE StuID  =  1004

question:  Who advises student 1004 ?
SQL:  SELECT Advisor FROM Student WHERE StuID  =  1004

question:  List Aerosmith 's albums .
SQL:  SELECT T1.title FROM albums AS T1 JOIN artists AS T2 ON  T1.artist_id = T2.id WHERE T2.name = "Aerosmith";

question:  What are the titles of all the Aerosmith albums ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN artists AS T2 ON  T1.artist_id = T2.id WHERE T2.name = "Aerosmith";

question:  List the name of albums that are released by aritist whose name has 'Led '
SQL:  SELECT T2.title FROM artists AS T1 JOIN albums AS T2 ON T1.id  =  T2.artist_id WHERE T1.name LIKE '%Led%'

question:  What is the title of the album that was released by the artist whose name has the phrase 'Led ' ?
SQL:  SELECT T2.title FROM artists AS T1 JOIN albums AS T2 ON T1.id  =  T2.artist_id WHERE T1.name LIKE '%Led%'

question:  Who is the composer of track Fast As a Shark ?
SQL:  SELECT composer FROM tracks WHERE name = "Fast As a Shark";

question:  What is the composer who created the track `` Fast As a Shark '' ?
SQL:  SELECT composer FROM tracks WHERE name = "Fast As a Shark";

question:  How long does track Fast As a Shark has ?
SQL:  SELECT milliseconds FROM tracks WHERE name = "Fast As a Shark";

question:  How many milliseconds long is Fast As a Shark ?
SQL:  SELECT milliseconds FROM tracks WHERE name = "Fast As a Shark";

question:  What is title of album which track Balls to the Wall belongs to ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T2.name = "Balls to the Wall";

question:  What is the name of the album that has the track Ball to the Wall ?
SQL:  SELECT T1.title FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T2.name = "Balls to the Wall";

question:  List name of all tracks in Balls to the Wall .
SQL:  SELECT T2.name FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.title = "Balls to the Wall";

question:  What is the name of all tracks in the album named Balls to the Wall ?
SQL:  SELECT T2.name FROM albums AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.title = "Balls to the Wall";

question:  How much is the track Fast As a Shark ?
SQL:  SELECT unit_price FROM tracks WHERE name = "Fast As a Shark";

question:  What is the unit price of the tune `` Fast As a Shark '' ?
SQL:  SELECT unit_price FROM tracks WHERE name = "Fast As a Shark";

question:  List the names of editors who are older than 25 .
SQL:  SELECT Name FROM editor WHERE Age  >  25

question:  Show the names of editors that are on the committee of journals with sales bigger than 3000 .
SQL:  SELECT T2.Name FROM journal_committee AS T1 JOIN editor AS T2 ON T1.Editor_ID  =  T2.Editor_ID JOIN journal AS T3 ON T1.Journal_ID  =  T3.Journal_ID WHERE T3.Sales  >  3000

question:  Show other account details for account with name 338 .
SQL:  SELECT other_account_details FROM Accounts WHERE account_name  =  "338"

question:  What are the other account details for the account with the name 338 ?
SQL:  SELECT other_account_details FROM Accounts WHERE account_name  =  "338"

question:  What are the names for tracks without a race in class 'GT ' .
SQL:  SELECT name FROM track EXCEPT SELECT T2.name FROM race AS T1 JOIN track AS T2 ON T1.track_id  =  T2.track_id WHERE T1.class  =  'GT'

question:  Give the names of tracks that do not have a race in the class 'GT ' .
SQL:  SELECT name FROM track EXCEPT SELECT T2.name FROM race AS T1 JOIN track AS T2 ON T1.track_id  =  T2.track_id WHERE T1.class  =  'GT'

question:  Which address do not have any member with the black membership card ?
SQL:  SELECT address FROM member EXCEPT SELECT address FROM member WHERE Membership_card  =  'Black'

question:  Find the title of all the albums of the artist `` AC/DC '' .
SQL:  SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"

question:  What are the titles of albums by the artist `` AC/DC '' ?
SQL:  SELECT Title FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T2.Name  =  "AC/DC"

question:  Which artist does the album `` Balls to the Wall '' belong to ?
SQL:  SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"

question:  Find the name of the artist who made the album `` Balls to the Wall '' .
SQL:  SELECT T2.Name FROM ALBUM AS T1 JOIN ARTIST AS T2 ON T1.ArtistId  =  T2.ArtistId WHERE T1.Title  =  "Balls to the Wall"

question:  What city does the employee who helps the customer with postal code 70174 live in ?
SQL:  SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"

question:  Find the cities corresponding to employees who help customers with the postal code 70174 .
SQL:  SELECT T2.City FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.PostalCode  =  "70174"

question:  Find all the customer last names that do not have invoice totals larger than 20 .
SQL:  SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20

question:  What are the last names of customers without invoice totals exceeding 20 ?
SQL:  SELECT LastName FROM CUSTOMER EXCEPT SELECT T1.LastName FROM CUSTOMER AS T1 JOIN Invoice AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T2.total  >  20

question:  Find the first names of all customers that live in Brazil and have an invoice .
SQL:  SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"

question:  What are the different first names for customers from Brazil who have also had an invoice ?
SQL:  SELECT DISTINCT T1.FirstName FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Brazil"

question:  Find the address of all customers that live in Germany and have invoice .
SQL:  SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"

question:  What are the addresses of customers living in Germany who have had an invoice ?
SQL:  SELECT DISTINCT T1.Address FROM CUSTOMER AS T1 JOIN INVOICE AS T2 ON T1.CustomerId  =  T2.CustomerId WHERE T1.country  =  "Germany"

question:  What are the birth dates of employees living in Edmonton ?
SQL:  SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

question:  Find the birth dates corresponding to employees who live in the city of Edmonton .
SQL:  SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

question:  What are the customer phone numbers under the policy `` Life Insurance '' ?
SQL:  SELECT customer_phone FROM available_policies WHERE policy_type_code  =  "Life Insurance"

question:  What are the phone numbers of customers using the policy with the code `` Life Insurance '' ?
SQL:  SELECT customer_phone FROM available_policies WHERE policy_type_code  =  "Life Insurance"

question:  What are all the policy types of the customer named `` Dayana Robel '' ?
SQL:  SELECT DISTINCT t3.policy_type_code FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id JOIN available_policies AS t3 ON t2.policy_id  =  t3.policy_id WHERE t1.customer_name  =  "Dayana Robel"

question:  Tell me the types of the policy used by the customer named `` Dayana Robel '' .
SQL:  SELECT DISTINCT t3.policy_type_code FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id JOIN available_policies AS t3 ON t2.policy_id  =  t3.policy_id WHERE t1.customer_name  =  "Dayana Robel"

question:  Find the IDs of customers whose name contains `` Diana '' .
SQL:  SELECT customer_id FROM customers WHERE customer_name LIKE "%Diana%"

question:  What are the IDs of customers who have `` Diana '' in part of their names ?
SQL:  SELECT customer_id FROM customers WHERE customer_name LIKE "%Diana%"

question:  Find the names of the chip models that are not used by any phone with full accreditation type .
SQL:  SELECT model_name FROM chip_model EXCEPT SELECT chip_model FROM phone WHERE Accreditation_type  =  'Full'

question:  Show the players from college UCLA .
SQL:  SELECT Player FROM match_season WHERE College  =  "UCLA"

question:  Who are the players from UCLA ?
SQL:  SELECT Player FROM match_season WHERE College  =  "UCLA"

question:  Which players are from Indonesia ?
SQL:  SELECT T2.Player FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Country_name  =  "Indonesia"

question:  Who are the players from Indonesia ?
SQL:  SELECT T2.Player FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Country_name  =  "Indonesia"

question:  What are the distinct positions of the players from a country whose capital is Dublin ?
SQL:  SELECT DISTINCT T2.Position FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Capital  =  "Dublin"

question:  Give the different positions of players who play for the country with the capital Dublin .
SQL:  SELECT DISTINCT T2.Position FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T1.Capital  =  "Dublin"

question:  Show the positions of the players from the team with name `` Ryley Goldner '' .